---
kind: property
id: P:Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes.HostByLinkNavigator
source: html/1f581d44-6739-1a19-a879-5af45bf6ee4c.htm
---
# Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes.HostByLinkNavigator Property

The host by link navigator pane.

## Syntax (C#)
```csharp
public static DockablePaneId HostByLinkNavigator { get; }
```